USE test;
SELECT *
FROM stock;
INSERT stock VALUES (NULL, "2015_07_24", "华泰证券", "601258", "庞大集团", "buy", 5.05, 100, 5, 0, 0.06);
INSERT stock VALUES (NULL, "2015_07_29", "华泰证券", "601258", "庞大集团", "buy", 4.30, 100, 5, 0, 0.06);
INSERT stock VALUES (NULL, "2015_07_31", "华泰证券", "601258", "庞大集团", "sell", 4.32, 200, 5, 0.43 * 2, 0.12);

INSERT stock VALUES (NULL, "2015_07_29", "华泰证券", "600050", "中国联通", "buy", 6.21, 100, 5, 0, 0.06);
INSERT stock VALUES (NULL, "2015_08_04", "华泰证券", "600050", "中国联通", "sell", 6.36, 100, 5, 0.636, 0.06);

INSERT stock VALUES (NULL, "2015_08_03", "华泰证券", "600467", "好当家", "buy", 7.21, 100, 5, 0, 0.06);
INSERT stock VALUES (NULL, "2015_08_04", "华泰证券", "600467", "好当家", "sell", 7.61, 100, 5, 0.761, 0.06);

INSERT stock VALUES (NULL, "2015_11_26", "华泰证券", "600221", "海南航空", "buy", 4.04, 100, 5, 0, 0.06);
INSERT stock VALUES (NULL, "2015_11_30", "华泰证券", "600221", "海南航空", "sell", 3.81, 100, 5, 0.381, 0.06);

INSERT stock VALUES (NULL, "2015_11_27", "华泰证券", "600317", "营口港", "buy", 4.89, 100, 5, 0, 0.06);
INSERT stock VALUES (NULL, "2015_12_08", "华泰证券", "600317", "营口港", "sell", 4.72, 100, 5, 0.472, 0.06);
