use stock;

INSERT stock VALUES (NULL, "2014_10_29", "广发基金", "000827", "百发100", "buy", 1, 200, 0, 0, 1.19);
INSERT stock VALUES (NULL, "2014_10_29", "广发基金", "000827", "百发100", "buy", 1, 200, 0, 0, 1.19);
INSERT stock VALUES (NULL, "2014_12_02", "广发基金", "000827", "百发100", "buy", 1.053, 188.80, 0, 0, 1.19);
INSERT stock VALUES (NULL, "2015_01_13", "广发基金", "000827", "百发100", "sell", 1.138, 1, 0, 0, 0);
INSERT stock VALUES (NULL, "2015_01_22", "广发基金", "000827", "百发100", "sell", 1.198, 85.46, 0, 0, 0.31);
INSERT stock VALUES (NULL, "2015_06_30", "广发基金", "000827", "百发100", "sell", 1.35, 143.88, 0, 0, 0.13);
INSERT stock VALUES (NULL, "2015_06_30", "广发基金", "000827", "百发100", "sell", 1.35, 496.20, 0, 0, 0.44);
INSERT stock VALUES (NULL, "2015_07_14", "广发基金", "000827", "百发100", "buy", 1.019, 97.55, 0, 0, 0.60);
INSERT stock VALUES (NULL, "2015_08_05", "广发基金", "000827", "百发100", "sell", 1.078, 97.55, 0, 0, 0.32);

INSERT stock VALUES (NULL, "2015_11_16", "广发基金", "001735", "百发大数据", "buy", 1, 900, 0, 0, 2.15);
INSERT stock VALUES (NULL, "2016_01_11", "广发基金", "001735", "百发大数据", "sell", 0.9830, 897.87, 0, 0, 4.41);
INSERT stock VALUES (NULL, "2015_12_31", "雪球补贴", "000000", "雪球补贴", "sell", 1, 115, 0, 0, 0);
