use stock;

INSERT stock VALUES (NULL, "2015_03_03", "国金证券", "601618", "中国中冶", "buy", 4.52, 100, 5, 0, 100 * 0.06 * 0.01);
INSERT stock VALUES (NULL, "2015_03_05", "国金证券", "601618", "中国中冶", "buy", 4.38, 100, 5, 0, 0.06);
INSERT stock VALUES (NULL, "2015_03_13", "国金证券", "601618", "中国中冶", "sell", 4.57, 100, 5, 457 * 0.1 * 0.01, 0.06);
INSERT stock VALUES (NULL, "2015_03_23", "国金证券", "601618", "中国中冶", "sell", 5.23, 100, 5, 523 * 0.1 * 0.01, 0.06);

INSERT stock VALUES (NULL, "2015_05_25", "国金证券", "000667", "美好集团", "buy", 5.94, 100, 5, 0, 0);
INSERT stock VALUES (NULL, "2015_05_27", "国金证券", "000667", "美好集团", "sell", 6.09, 100, 5, 609 * 0.001, 0);

INSERT stock VALUES (NULL, "2015_05_27", "国金证券", "000667", "美好集团", "buy", 6.08, 100, 5, 0, 0);
INSERT stock VALUES (NULL, "2015_05_28", "国金证券", "000667", "美好集团", "sell", 6.12, 100, 5, 612 * 0.001, 0);

INSERT stock VALUES (NULL, "2015_05_28", "国金证券", "000667", "美好集团", "buy", 6.20, 100, 5, 0, 0);
INSERT stock VALUES (NULL, "2015_05_29", "国金证券", "000667", "美好集团", "buy", 5.92, 100, 5, 0, 0);
INSERT stock VALUES (NULL, "2015_05_29", "国金证券", "000667", "美好集团", "buy", 5.71, 100, 5, 0, 0);
INSERT stock VALUES (NULL, "2015_05_29", "国金证券", "000667", "美好集团", "buy", 5.59, 100, 5, 0, 0);
INSERT stock VALUES (NULL, "2015_06_01", "国金证券", "000667", "美好集团", "sell", 5.71, 200, 5, 571 * 2 * 0.001, 0);
INSERT stock VALUES (NULL, "2015_06_09", "国金证券", "000667", "美好集团", "sell", 6.43, 100, 5, 0.643, 0);
INSERT stock VALUES (NULL, "2015_06_11", "国金证券", "000667", "美好集团", "sell", 6.47, 100, 5, 0.647, 0);

INSERT stock VALUES (NULL, "2015_06_04", "国金证券", "600221", "海南航空", "buy", 5.56, 100, 5, 0, 0.06);
INSERT stock VALUES (NULL, "2015_06_08", "国金证券", "600221", "海南航空", "other", 6.06, 1, 0, 0, 0);
INSERT stock VALUES (NULL, "2015_06_16", "国金证券", "600221", "海南航空", "sell", 6.50, 100, 5, 0.650, 0.06);

INSERT stock VALUES (NULL, "2015_06_11", "国金证券", "000667", "美好集团", "buy", 6.68, 100, 5, 0, 0);
INSERT stock VALUES (NULL, "2015_06_19", "国金证券", "000667", "美好集团", "sell", 8.31, 100, 5, 0.831, 0);

INSERT stock VALUES (NULL, "2015_06_19", "国金证券", "000667", "美好集团", "buy", 8.15, 100, 5, 0, 0);
INSERT stock VALUES (NULL, "2015_06_24", "国金证券", "000667", "美好集团", "sell", 7.66, 100, 5, 0.766, 0);

INSERT stock VALUES (NULL, "2015_07_15", "国金证券", "600467", "好当家", "buy", 7.52, 100, 5, 0, 0.06);
INSERT stock VALUES (NULL, "2015_07_20", "国金证券", "600467", "好当家", "sell", 8.10, 100, 5, 0.81, 0.06);

INSERT stock VALUES (NULL, "2015_07_20", "国金证券", "600467", "好当家", "buy", 8.02, 100, 5, 0, 0.06);
INSERT stock VALUES (NULL, "2015_07_21", "国金证券", "600467", "好当家", "sell", 8.75, 100, 5, 0.875, 0.06);

INSERT stock VALUES (NULL, "2015_07_20", "国金证券", "600050", "中国联通", "buy", 7.10, 100, 5, 0, 0.06);
INSERT stock VALUES (NULL, "2015_07_21", "国金证券", "600050", "中国联通", "sell", 7.21, 100, 5, 0.721, 0.06);

INSERT stock VALUES (NULL, "2015_08_03", "国金证券", "600221", "海南航空", "buy", 5.21, 100, 5, 0, 0.06);
INSERT stock VALUES (NULL, "2015_08_05", "国金证券", "600221", "海南航空", "sell", 5.50, 100, 5, 0.55, 0.06);

INSERT stock VALUES (NULL, "2015_08_06", "国金证券", "000100", "TCL集团", "buy", 5.20, 100, 5, 0, 0);
INSERT stock VALUES (NULL, "2015_08_07", "国金证券", "000100", "TCL集团", "sell", 5.14, 100, 5, 0.514, 0);

INSERT stock VALUES (NULL, "2015_08_05", "国金证券", "600035", "楚天高速", "buy", 6.06, 100, 5, 0, 0.06);
INSERT stock VALUES (NULL, "2015_08_11", "国金证券", "600035", "楚天高速", "sell", 6.50, 100, 5, 0.65, 0.06);

INSERT stock VALUES (NULL, "2015_08_07", "国金证券", "002379", "鲁丰环保", "buy", 5.44, 100, 5, 0, 0);
INSERT stock VALUES (NULL, "2015_08_11", "国金证券", "002379", "鲁丰环保", "sell", 5.80, 100, 5, 0.58, 0);

INSERT stock VALUES (NULL, "2015_08_05", "国金证券", "600467", "好当家", "buy", 7.74, 100, 5, 0, 0.06);
INSERT stock VALUES (NULL, "2015_08_11", "国金证券", "600467", "好当家", "sell", 8.16, 100, 5, 0.816, 0.06);

INSERT stock VALUES (NULL, "2015_08_11", "国金证券", "600470", "六国化工", "buy", 9.03, 200, 5, 0, 0.12);
INSERT stock VALUES (NULL, "2015_08_13", "国金证券", "600470", "六国化工", "sell", 8.72, 200, 5, 0.872 * 2, 0.12);

INSERT stock VALUES (NULL, "2015_08_13", "国金证券", "600035", "楚天高速", "buy", 6.53, 300, 5, 0, 0.18);
INSERT stock VALUES (NULL, "2015_08_14", "国金证券", "600035", "楚天高速", "sell", 6.68, 300, 5, 0.668 * 3, 0.18);

INSERT stock VALUES (NULL, "2015_08_25", "国金证券", "000725", "京东方A", "buy", 3.02, 100, 5, 0, 0);
INSERT stock VALUES (NULL, "2015_08_27", "国金证券", "000725", "京东方A", "sell", 3.00, 100, 5, 0.3, 0);

INSERT stock VALUES (NULL, "2015_08_18", "国金证券", "600221", "海南航空", "buy", 5.26, 100, 5, 0, 0.06);
INSERT stock VALUES (NULL, "2015_08_26", "国金证券", "600221", "海南航空", "buy", 3.80, 100, 5, 0, 0.06);
INSERT stock VALUES (NULL, "2015_09_01", "国金证券", "600221", "海南航空", "sell", 3.99, 200, 5, 0.399 * 2, 0.12);

INSERT stock VALUES (NULL, "2015_08_14", "国金证券", "601258", "庞大集团", "buy", 5.25, 100, 5, 0, 0.06);
INSERT stock VALUES (NULL, "2015_08_26", "国金证券", "601258", "庞大集团", "buy", 3.77, 100, 5, 0, 0.06);
INSERT stock VALUES (NULL, "2015_09_01", "国金证券", "601258", "庞大集团", "sell", 4.24, 200, 5, 0.424 * 2, 0.12);

INSERT stock VALUES (NULL, "2015_09_25", "国金证券", "601258", "庞大集团", "buy", 3.69, 100, 5, 0, 0.06);
INSERT stock VALUES (NULL, "2015_10_09", "国金证券", "601258", "庞大集团", "sell", 3.80, 100, 5, 0.38, 0.06);

INSERT stock VALUES (NULL, "2015_09_28", "国金证券", "600035", "楚天高速", "buy", 4.36, 100, 5, 0, 0.06);
INSERT stock VALUES (NULL, "2015_10_09", "国金证券", "600035", "楚天高速", "sell", 4.47, 100, 5, 0.447, 0.06);

INSERT stock VALUES (NULL, "2015_10_26", "国金证券", "000918", "嘉凯城", "buy", 4.91, 100, 5, 0, 0);
INSERT stock VALUES (NULL, "2015_11_13", "国金证券", "000918", "嘉凯城", "sell", 5.12, 100, 5, 0.512, 0);

INSERT stock VALUES (NULL, "2015_12_24", "国金证券", "000667", "美好集团", "buy", 4.94, 100, 5, 0, 0);
INSERT stock VALUES (NULL, "2015_12_30", "国金证券", "000667", "美好集团", "sell", 5.06, 100, 5, 0.506, 0);
