use stock;

INSERT stock VALUES (NULL, "2016_01_26", "国金证券", "600221", "海航控股", "buy", 3.21, 100, 5, 0, 3.21*0.002,20161);
INSERT stock VALUES (NULL, "2016_02_01", "国金证券", "600221", "海航控股", "sell", 2.99, 100, 5, 0.299, 2.99*0.002,20161);

INSERT stock VALUES (NULL, "2016_02_23", "国金证券", "600567", "山鹰纸业", "buy", 3.11, 100, 5, 0, 3.11*0.002,20162);
INSERT stock VALUES (NULL, "2016_03_03", "国金证券", "600567", "山鹰纸业", "sell", 3.04, 100, 5, 0.304, 3.04*0.002,20162);

INSERT stock VALUES (NULL, "2016_08_29", "国金证券", "000630", "铜陵有色", "buy", 2.62, 100, 5, 0, 0,20163);
INSERT stock VALUES (NULL, "2016_11_03", "国金证券", "000630", "铜陵有色", "sell", 2.75, 100, 5, 0.275, 0,20163);
