use stock;

INSERT stock VALUES (NULL, "2020_10_19", "银河证券", "110075", "南航转债", "buy", 100, 20, 0, 0, 0);
INSERT stock VALUES (NULL, "2020_11_03", "银河证券", "110075", "南航转债", "sell", 110.23, 20, 1, 0, 0);

INSERT stock VALUES (NULL, "2020_11_03", "银河证券", "110075", "南航转债", "buy", 115.36, 10, 1, 0, 0);
INSERT stock VALUES (NULL, "2020_11_04", "银河证券", "110075", "南航转债", "sell", 118.70, 10, 1, 0, 0);

INSERT stock VALUES (NULL, "2020_07_09", "银河证券", "600397", "安源煤业", "buy", 2.89, 100, 5, 0, 2.89*0.002);
INSERT stock VALUES (NULL, "2020_11_24", "银河证券", "600397", "安源煤业", "sell", 3.21, 100, 5, 0.321, 3.21*0.002);
