use stock;

INSERT stock VALUES (NULL, "2020_02_04", "平安证券", "601001", "大同煤业", "buy", 3.64, 100, 5, 0, 3.64*0.002);
INSERT stock VALUES (NULL, "2020_03_05", "平安证券", "601001", "大同煤业", "sell", 4.02, 100, 5, 0.402, 4.02*0.002);

INSERT stock VALUES (NULL, "2020_04_20", "平安证券", "113033", "利群转债", "buy", 100, 10, 0, 0, 0);
INSERT stock VALUES (NULL, "2020_04_21", "平安证券", "113033", "利群转债", "sell", 108.71, 10, 1, 0, 0);
INSERT stock VALUES (NULL, "2020_04_21", "平安证券", "113033", "利群转债", "buy", 108.82, 10, 1, 0, 0);
INSERT stock VALUES (NULL, "2020_04_24", "平安证券", "113033", "利群转债", "sell", 108.53, 10, 1, 0, 0);
