use stock;

INSERT stock VALUES (NULL, "2021_01_26", "平安证券", "113042", "上银转债", "buy", 100, 10, 0, 0, 0);
INSERT stock VALUES (NULL, "2021_02_10", "平安证券", "113042", "上银转债", "sell", 100.17, 10, 1, 0, 0);

INSERT stock VALUES (NULL, "2021_01_29", "平安证券", "000673", "当代东方", "buy", 1.35, 100, 5, 0, 0);
INSERT stock VALUES (NULL, "2021_03_11", "平安证券", "000673", "当代东方", "sell", 2.18, 100, 5, 0.218, 0);

INSERT stock VALUES (NULL, "2021_03_18", "平安证券", "000673", "当代东方", "buy", 2.44, 200, 5, 0, 0);
INSERT stock VALUES (NULL, "2021_03_25", "平安证券", "000673", "当代东方", "sell", 2.63, 200, 5, 0.526, 0);

INSERT stock VALUES (NULL, "2021_05_31", "平安证券", "600221", "海航控股", "buy", 2.18, 100, 5, 0, 2.18*0.002);
INSERT stock VALUES (NULL, "2021_06_04", "平安证券", "600221", "海航控股", "sell", 2.36, 100, 5, 0.236, 2.36*0.002);
