use stock;

INSERT stock VALUES (NULL, "2021_03_30", "银河证券", "127030", "盛虹转债", "buy", 100, 10, 0, 0, 0,20211);
INSERT stock VALUES (NULL, "2021_04_22", "银河证券", "127030", "盛虹转债", "sell", 124.02, 10, 1.24, 0, 0,20211);

INSERT stock VALUES (NULL, "2020_11_24", "银河证券", "600035", "楚天高速", "buy", 2.97, 100, 5, 0, 2.97*0.002,20212);
INSERT stock VALUES (NULL, "2021_05_17", "银河证券", "600035", "楚天高速", "sell", 3.10, 100, 5, 0.31, 3.1*0.002,20212);

INSERT stock VALUES (NULL, "2021_04_22", "银河证券", "110079", "杭银转债", "buy", 100, 10, 0, 0, 0,20213);
INSERT stock VALUES (NULL, "2021_04_26", "银河证券", "110079", "杭银转债", "sell", 112.81, 10, 1, 0, 0,20213);

INSERT stock VALUES (NULL, "2021_04_23", "银河证券", "127032", "苏行转债", "buy", 100, 20, 0, 0, 0,20214);
INSERT stock VALUES (NULL, "2021_05_17", "银河证券", "127032", "苏行转债", "sell", 106.53, 20, 1.065*2, 0, 0,20214);

INSERT stock VALUES (NULL, "2021_01_12", "银河证券", "600397", "安源煤业", "buy", 2.86, 100, 5, 0, 2.86*0.002,20215);
INSERT stock VALUES (NULL, "2021_06_17", "银河证券", "600397", "安源煤业", "sell", 3.08, 100, 5, 0.308, 3.08*0.002,20215);

INSERT stock VALUES (NULL, "2021_07_02", "银河证券", "600221", "海航控股", "buy", 2.13, 100, 5, 0, 2.13*0.002,20216);
INSERT stock VALUES (NULL, "2021_09_10", "银河证券", "600221", "海航控股", "sell", 2.54, 100, 5, 0.254, 2.54*0.002,20216);
