use stock;

INSERT stock VALUES (NULL, "2020_06_08", "大同证券", "600467", "好当家", "buy", 2.67, 100, 5, 0, 2.67*0.002,20211);
INSERT stock VALUES (NULL, "2020_07_16", "大同证券", "600467", "好当家", "other", 1.3, 1, 0, 0, 0,20211);
INSERT stock VALUES (NULL, "2021_07_15", "大同证券", "600467", "好当家", "other", 1.4, 1, 0, 0, 0,20211);
INSERT stock VALUES (NULL, "2021_11_05", "大同证券", "600467", "好当家", "sell", 2.87, 100, 5, 0.28, 2.87*0.002,20211);

INSERT stock VALUES (NULL, "2021_01_25", "大同证券", "000667", "美好集团", "buy", 1.96, 100, 5, 0, 0,20212);
INSERT stock VALUES (NULL, "2021_10_28", "大同证券", "000667", "美好集团", "buy", 1.57, 100, 5, 0, 0,20212);
INSERT stock VALUES (NULL, "2021_12_21", "大同证券", "000667", "美好集团", "sell", 1.96, 200, 5, 0.392, 0,20212);
