use stock;

INSERT stock VALUES (NULL, "2022_02_24", "华宝证券", "113017", "吉视转债", "buy", 125.17, 10, 0.5, 0, 0,20221);
INSERT stock VALUES (NULL, "2022_03_01", "华宝证券", "113017", "吉视转债", "sell", 126.09, 10, 0.5, 0, 0,20221);
INSERT stock VALUES (NULL, "2022_03_01", "华宝证券", "113017", "吉视转债", "buy", 126.29, 10, 0.5, 0, 0,20221);
INSERT stock VALUES (NULL, "2022_03_01", "华宝证券", "113017", "吉视转债", "sell", 126.5, 10, 0.5, 0, 0,20221);
INSERT stock VALUES (NULL, "2022_03_02", "华宝证券", "113017", "吉视转债", "buy", 124.76, 10, 0.5, 0, 0,20221);
INSERT stock VALUES (NULL, "2022_03_02", "华宝证券", "113017", "吉视转债", "sell", 124.57, 10, 0.5, 0, 0,20221);
INSERT stock VALUES (NULL, "2022_03_02", "华宝证券", "113017", "吉视转债", "buy", 124.72, 10, 0.5, 0, 0,20221);
INSERT stock VALUES (NULL, "2022_03_02", "华宝证券", "113017", "吉视转债", "sell", 124.89, 10, 0.5, 0, 0,20221);
INSERT stock VALUES (NULL, "2022_03_03", "华宝证券", "113017", "吉视转债", "buy", 125.59, 10, 0.5, 0, 0,20221);
INSERT stock VALUES (NULL, "2022_03_03", "华宝证券", "113017", "吉视转债", "sell", 125.11, 10, 0.5, 0, 0,20221);
INSERT stock VALUES (NULL, "2022_03_03", "华宝证券", "113017", "吉视转债", "buy", 126.06, 10, 0.5, 0, 0,20221);
INSERT stock VALUES (NULL, "2022_03_03", "华宝证券", "113017", "吉视转债", "sell", 125.38, 10, 0.5, 0, 0,20221);

INSERT stock VALUES (NULL, "2022_04_14", "华宝证券", "113056", "重银转债", "buy", 100, 10, 0, 0, 0,20222);
INSERT stock VALUES (NULL, "2022_04_14", "华宝证券", "113056", "重银转债", "sell", 104.65, 10, 0.5, 0, 0,20222);
INSERT stock VALUES (NULL, "2022_04_14", "华宝证券", "113056", "重银转债", "buy", 105.16, 10, 0.5, 0, 0,20222);
INSERT stock VALUES (NULL, "2022_04_14", "华宝证券", "113056", "重银转债", "sell", 104.41, 10, 0.5, 0, 0,20222);
INSERT stock VALUES (NULL, "2022_04_14", "华宝证券", "113056", "重银转债", "buy", 105.03, 10, 0.5, 0, 0,20222);
INSERT stock VALUES (NULL, "2022_04_14", "华宝证券", "113056", "重银转债", "sell", 104.87, 10, 0.5, 0, 0,20222);
INSERT stock VALUES (NULL, "2022_04_14", "华宝证券", "113056", "重银转债", "buy", 105.05, 10, 0.5, 0, 0,20222);
INSERT stock VALUES (NULL, "2022_04_14", "华宝证券", "113056", "重银转债", "sell", 104.97, 10, 0.5, 0, 0,20222);
INSERT stock VALUES (NULL, "2022_04_14", "华宝证券", "113056", "重银转债", "buy", 105.03, 10, 0.5, 0, 0,20222);
INSERT stock VALUES (NULL, "2022_04_14", "华宝证券", "113056", "重银转债", "sell", 104.98, 10, 0.5, 0, 0,20222);

INSERT stock VALUES (NULL, "2022_04_14", "华宝证券", "110084", "贵燃转债", "buy", 108.46, 10, 0.5, 0, 0,20223);
INSERT stock VALUES (NULL, "2022_04_14", "华宝证券", "110084", "贵燃转债", "sell", 108.34, 10, 0.5, 0, 0,20223);
INSERT stock VALUES (NULL, "2022_04_14", "华宝证券", "110084", "贵燃转债", "buy", 108.78, 10, 0.5, 0, 0,20223);
INSERT stock VALUES (NULL, "2022_04_14", "华宝证券", "110084", "贵燃转债", "sell", 108.33, 10, 0.5, 0, 0,20223);

INSERT stock VALUES (NULL, "2022_04_20", "华宝证券", "127058", "科伦转债", "buy", 100, 10, 0, 0, 0,20224);
INSERT stock VALUES (NULL, "2022_04_20", "华宝证券", "127058", "科伦转债", "sell", 119.11, 10, 0.5, 0, 0,20224);
INSERT stock VALUES (NULL, "2022_04_20", "华宝证券", "127058", "科伦转债", "buy", 121.564, 10, 0.5, 0, 0,20224);
INSERT stock VALUES (NULL, "2022_04_20", "华宝证券", "127058", "科伦转债", "sell", 119.44, 10, 0.5, 0, 0,20224);
INSERT stock VALUES (NULL, "2022_04_20", "华宝证券", "127058", "科伦转债", "buy", 119.221, 10, 0.5, 0, 0,20224);
INSERT stock VALUES (NULL, "2022_04_20", "华宝证券", "127058", "科伦转债", "sell", 118.336, 10, 0.5, 0, 0,20224);

INSERT stock VALUES (NULL, "2022_05_06", "华宝证券", "110052", "贵广转债", "buy", 116.77, 10, 0.5, 0, 0,20225);
INSERT stock VALUES (NULL, "2022_05_11", "华宝证券", "110052", "贵广转债", "sell", 117.37, 10, 0.5, 0, 0,20225);
INSERT stock VALUES (NULL, "2022_05_11", "华宝证券", "110052", "贵广转债", "buy", 116.84, 10, 0.5, 0, 0,20225);
INSERT stock VALUES (NULL, "2022_05_16", "华宝证券", "110052", "贵广转债", "sell", 117.66, 10, 0.5, 0, 0,20225);
INSERT stock VALUES (NULL, "2022_05_16", "华宝证券", "110052", "贵广转债", "buy", 117.46, 10, 0.5, 0, 0,20225);
INSERT stock VALUES (NULL, "2022_05_18", "华宝证券", "110052", "贵广转债", "sell", 115.57, 10, 0.5, 0, 0,20225);
INSERT stock VALUES (NULL, "2022_05_19", "华宝证券", "110052", "贵广转债", "buy", 115.25, 10, 0.5, 0, 0,20225);
INSERT stock VALUES (NULL, "2022_05_19", "华宝证券", "110052", "贵广转债", "sell", 115.38, 10, 0.5, 0, 0,20225);

INSERT stock VALUES (NULL, "2022_03_03", "华宝证券", "110084", "贵燃转债", "buy", 123.27, 10, 0.5, 0, 0,20223);
INSERT stock VALUES (NULL, "2022_05_27", "华宝证券", "110084", "贵燃转债", "sell", 116.04, 10, 0.5, 0, 0,20223);

INSERT stock VALUES (NULL, "2022_06_09", "华宝证券", "110084", "贵燃转债", "buy", 132.67, 10, 0.5, 0, 0,20223);
INSERT stock VALUES (NULL, "2022_06_10", "华宝证券", "110084", "贵燃转债", "sell", 137.68, 10, 0.5, 0, 0,20223);

INSERT stock VALUES (NULL, "2022_02_25", "华宝证券", "000767", "晋控电力", "buy", 4.11, 100, 5, 0, 0,20224);
INSERT stock VALUES (NULL, "2022_06_21", "华宝证券", "000767", "晋控电力", "sell", 4.24, 100, 5, 4.24*0.1*2, 0,20224);
