use stock;

INSERT stock VALUES (NULL, "2021_10_28", "平安证券", "601880", "大连港", "buy", 1.67, 200, 5, 0, 1.67*0.002*2,20221);
INSERT stock VALUES (NULL, "2022_01_11", "平安证券", "601880", "大连港", "sell", 1.76, 200, 5, 0.176*2, 1.76*0.002*2,20221);

INSERT stock VALUES (NULL, "2021_09_10", "平安证券", "600606", "绿地控股", "buy", 4.76, 100, 5, 0, 4.76*0.002,20222);
INSERT stock VALUES (NULL, "2022_01_11", "平安证券", "600606", "绿地控股", "sell", 4.58, 100, 5, 0.458, 4.58*0.002,20222);

INSERT stock VALUES (NULL, "2021_12_28", "平安证券", "113052", "兴业转债", "buy", 100, 10, 0, 0, 0,20223);
INSERT stock VALUES (NULL, "2022_01_14", "平安证券", "113052", "兴业转债", "sell", 112, 10, 1, 0, 0,20223);

INSERT stock VALUES (NULL, "2021_08_25", "平安证券", "600050", "中国联通", "buy", 4.14, 100, 5, 0, 4.14*0.002,20224);
INSERT stock VALUES (NULL, "2021_11_16", "平安证券", "600050", "中国联通", "other", 4.88-0.49, 1, 0, 0, 0,20224);
INSERT stock VALUES (NULL, "2022_01_20", "平安证券", "600050", "中国联通", "sell", 4.02, 100, 5, 0.402, 4.02*0.002,20224);

INSERT stock VALUES (NULL, "2021_08_25", "平安证券", "601728", "中国电信", "buy", 4.83, 100, 5, 0, 4.83*0.002,20225);
INSERT stock VALUES (NULL, "2021_11_30", "平安证券", "601728", "中国电信", "buy", 4.29, 100, 5, 0, 4.29*0.002,20225);
INSERT stock VALUES (NULL, "2022_01_11", "平安证券", "601728", "中国电信", "buy", 4.32, 100, 5, 0, 4.32*0.002,20225);
-- INSERT stock VALUES (NULL, "2022_01_25", "平安证券", "601728", "中国电信", "buy", 4.21, 100, 5, 0, 4.21*0.002,20225);
INSERT stock VALUES (NULL, "2022_01_25", "平安证券", "601728", "中国电信", "sell", 4.19, 300, 5, 0.419*3, 4.19*0.002*3,20225);

INSERT stock VALUES (NULL, "2021_12_28", "平安证券", "110084", "贵燃转债", "buy", 100, 10, 0, 0, 0,20226);
INSERT stock VALUES (NULL, "2022_01_20", "平安证券", "110084", "贵燃转债", "sell", 117.76, 10, 1, 0, 0,20226);

INSERT stock VALUES (NULL, "2022_01_20", "平安证券", "113017", "吉视转债", "buy", 151.96, 10, 1, 0, 0,20227);
INSERT stock VALUES (NULL, "2022_01_20", "平安证券", "113017", "吉视转债", "sell", 155.03, 10, 1, 0, 0,20227);
INSERT stock VALUES (NULL, "2022_01_20", "平安证券", "113017", "吉视转债", "buy", 156.96, 10, 1, 0, 0,20227);
INSERT stock VALUES (NULL, "2022_01_20", "平安证券", "113017", "吉视转债", "sell", 157.98, 10, 1, 0, 0,20227);
INSERT stock VALUES (NULL, "2022_01_20", "平安证券", "113017", "吉视转债", "buy", 159.25, 10, 1, 0, 0,20227);
INSERT stock VALUES (NULL, "2022_01_20", "平安证券", "113017", "吉视转债", "sell", 156.71, 10, 1, 0, 0,20227);
INSERT stock VALUES (NULL, "2022_01_20", "平安证券", "113017", "吉视转债", "buy", 157.1, 10, 1, 0, 0,20227);
INSERT stock VALUES (NULL, "2022_01_21", "平安证券", "113017", "吉视转债", "sell", 164, 10, 1, 0, 0,20227);

INSERT stock VALUES (NULL, "2022_01_20", "平安证券", "110084", "贵燃转债", "buy", 118.06, 10, 1, 0, 0,20226);
INSERT stock VALUES (NULL, "2022_01_25", "平安证券", "110084", "贵燃转债", "sell", 116.95, 10, 1, 0, 0,20226);

INSERT stock VALUES (NULL, "2022_01_25", "平安证券", "600050", "中国联通", "buy", 3.85, 100, 5, 0, 3.85*0.002,20224);
INSERT stock VALUES (NULL, "2022_01_27", "平安证券", "600050", "中国联通", "sell", 3.72, 100, 5, 0.372, 3.72*0.002,20224);

INSERT stock VALUES (NULL, "2022_01_27", "平安证券", "601868", "中国能建", "buy", 2.67, 500, 5, 0, 2.67*0.002*5,20228);
INSERT stock VALUES (NULL, "2022_02_07", "平安证券", "601868", "中国能建", "sell", 2.76, 500, 5, 0.276*5, 2.76*0.002*5,20228);

INSERT stock VALUES (NULL, "2022_01_28", "平安证券", "600397", "安源煤业", "buy", 2.70, 100, 5, 0, 2.70*0.002,20229);
INSERT stock VALUES (NULL, "2022_02_07", "平安证券", "600397", "安源煤业", "sell", 2.90, 100, 5, 0.290, 2.90*0.002,20229);

INSERT stock VALUES (NULL, "2022_01_27", "平安证券", "600035", "楚天高速", "buy", 3.03, 100, 5, 0, 3.03*0.002,202210);
INSERT stock VALUES (NULL, "2022_02_07", "平安证券", "600035", "楚天高速", "sell", 3.19, 100, 5, 0.319, 3.19*0.002,202210);

INSERT stock VALUES (NULL, "2022_01_27", "平安证券", "600467", "好当家", "buy", 2.66, 100, 5, 0, 2.66*0.002,202211);
INSERT stock VALUES (NULL, "2022_02_08", "平安证券", "600467", "好当家", "sell", 2.96, 100, 5, 0.296, 2.96*0.002,202211);

INSERT stock VALUES (NULL, "2022_01_27", "平安证券", "110084", "贵燃转债", "buy", 117.25, 10, 1, 0, 0,20226);
INSERT stock VALUES (NULL, "2022_02_08", "平安证券", "110084", "贵燃转债", "sell", 117.57, 10, 1, 0, 0,20226);
INSERT stock VALUES (NULL, "2022_02_08", "平安证券", "110084", "贵燃转债", "buy", 117.85, 10, 1, 0, 0,20226);
INSERT stock VALUES (NULL, "2022_02_08", "平安证券", "110084", "贵燃转债", "sell", 121.60, 10, 1, 0, 0,20226);

INSERT stock VALUES (NULL, "2022_01_28", "平安证券", "601929", "吉视传媒", "buy", 2.36, 100, 5, 0, 0,202212);
INSERT stock VALUES (NULL, "2022_02_23", "平安证券", "601929", "吉视传媒", "sell", 2.63, 100, 5, 0.263, 2.63*0.002,202212);
